all_account=('1000001','1000002','1000003','1000005','1000006','1000007','1000010','1000011','1000014','1000015','1000016','1000019','1000027','1000029','1000030','1000031','1000037','1000038','1000039','1000040','1000041','1000047','1000055','1000056','1000057','1000060','1000061','1000062','1000091','1000092','1000093','1000095','1000098','1000101','1000103','1000105','1000108','1000125','1000127','1000132','1000136','1000137','1000143','1000157','1000159','1000175','1000176','1000178','1000179','1000180','1000181','1000182','1000183','1000184','1000185','1000186','1000187','1000190','1000191','1000193','1000194','1000195','1000202','1000204','1000210','1000211','1000212','1000213','1000215','1000216','1000219','1000220','1000221','1000222','1000231','1000232','1000233','1000236','1000237','1000239','1000240','1000241','1000242','1000244','1000246')

account_1 = ('1000001','1000002','1000003','1000005','1000010','1000011','1000014','1000015','1000125','1000202','1000204','1000219','1000221','1000019')
account_2 =('1000027','1000029','1000030','1000031','1000038','1000039','1000040','1000041','1000215','1000222')
account_3 = ('1000231','1000232','1000233')
account_4 = ('1000055','1000056','1000057','1000060','1000108','1000157','1000159','1000181','1000182','1000183','1000184','1000185','1000186','1000187','1000210','1000211','1000212','1000213','1000216','1000220')
account_5 = ('1000061','1000062','1000103','1000132')
account_6 = ('1000178','1000179')
coffee    = ('1000176','1000244','1000180')
market    = ('1000241','1000242','1000175','1000006','1000007','1000037','1000047','1000136','1000239','1000246','1000105','1000016','1000143')
bath      = ('1000091','1000092','1000093','1000095')
'''
--select * from EMC.dbo.merchant where  codename like '%五%' ;
1
codename	toaccount	accountname	address
闵行第一食堂	1000001	淮扬快餐	
闵行第一食堂	1000002	海派食府	
闵行第一食堂	1000003	中式点心	
闵行第一食堂	1000005	一餐教工餐厅	

闵行第一食堂	1000010	吉祥小厨	
闵行第一食堂	1000011	顺日北小吃	
闵行第一食堂	1000014	高知餐厅	
闵行第一食堂	1000015	川菜	
闵行第一食堂	1000125	供应点1	
闵行第一食堂	1000202	闵行一餐临时	印务 校园环境
闵行第一食堂	1000204	松叶蔬菜	
闵行第一食堂	1000219	一餐清真	闵行一餐回民餐厅
闵行第一食堂	1000221	一餐教工定额卡	第一餐饮大楼二楼

闵行西区超市	1000019	哈乐之家 // special

2
codename	toaccount	accountname	address
闵行第二食堂	1000027	上海快餐	
闵行第二食堂	1000029	西北面点	
闵行第二食堂	1000030	江南小吃	
闵行第二食堂	1000031	川味点心	
	
闵行第二食堂	1000038	大众餐厅	
闵行第二食堂	1000039	新疆餐厅	
闵行第二食堂	1000040	二大楼教工餐厅	闵行第二餐饮大楼二楼
闵行第二食堂	1000041	绿园餐厅	
闵行第二食堂	1000215	西式快餐	闵二
闵行第二食堂	1000222	上海快餐定额卡	第二餐饮大楼一楼

3
	
闵行第三食堂	1000231	闵行第三餐饮外婆桥	闵行第三餐饮二楼
闵行第三食堂	1000232	闵行第三餐饮清真餐厅	闵行第三餐饮二楼
闵行第三食堂	1000233	闵行第三餐饮学生餐厅	闵行第三餐饮一楼


4
闵行第四食堂	1000055	东餐厅	
闵行第四食堂	1000056	西餐厅	
闵行第四食堂	1000057	面点	
闵行第四食堂	1000060	炖品	四餐2楼
闵行第四食堂	1000108	苏记麻辣烫	
	
	
闵行第四食堂	1000159	教工餐厅	第四餐饮大楼二楼东面
闵行第四食堂	1000181	串串烧	四餐二楼西面
闵行第四食堂	1000182	麻辣烫	四餐2楼西面
闵行第四食堂	1000183	笼仔饭	四餐二楼西面
闵行第四食堂	1000184	粉面饭	四餐二楼西面
闵行第四食堂	1000185	烧腊饭	四餐二楼西面
闵行第四食堂	1000186	甜点	四餐二楼西面
闵行第四食堂	1000187	点心	四餐二楼西面
闵行第四食堂	1000210	炒面	四餐一楼西部
闵行第四食堂	1000211	土豆粉	四餐一楼西部
闵行第四食堂	1000212	烤肉	四餐一楼西部
闵行第四食堂	1000213	粥档	四餐一楼西部
闵行第四食堂	1000216	风味煲仔饭	第四餐饮大楼一楼西端
闵行第四食堂	1000220	后发定额卡（第四餐饮）	四餐大楼一楼
闵行第四食堂	1000157	吉姆丽德

5
闵行五餐食堂	1000061	一楼快餐厅	
闵行五餐食堂	1000062	二楼快餐厅	
闵行五餐食堂	1000103	二楼面馆		
闵行五餐食堂	1000132	中西餐厅	

6.codename	toaccount	accountname
闵行第六食堂	1000178	六餐东一楼餐厅
闵行第六食堂	1000179	六餐面馆


6 coffee
闵行第一食堂2	1000176	甜魔咖啡	闵行校车候车室旁侧
闵行第三食堂	1000244	闵行三餐时光咖啡	第三餐饮大楼一楼
闵行第六食堂	1000180	六餐伊诺咖啡

--select * from EMC.dbo.merchant where  codename not like '%食堂%' ;
7 market
闵行第一食堂	1000241	达通一餐蔬菜店	一餐候车亭旁
闵行第一食堂	1000242	达通一餐水果店	一餐候车亭旁
闵行西区超市	1000175	浓清水果店（哈乐餐厅）	教育超市
闵行第一食堂	1000006	面包房1	
闵行第一食堂	1000007	梦园面包房2	
闵行第二食堂	1000037	教育超市
闵行第三食堂	1000047	北区教育超市
闵行第四食堂	1000136	百味林
新闵行第四食堂	1000239	达通闵行四餐水果吧	四餐东面电梯下
闵行第四食堂	1000246	闵行四餐面包房	四餐一楼
闵行五餐食堂	1000105	第五餐饮教育超市

闵行超市对接代理	1000016	闵行教育超市
教育超市柜台	1000143	教育超市	教育超市柜台

8 bath
闵行西区浴室	1000091	闵行西区浴室	
闵行北区浴室	1000092	闵行北区浴室	
闵行东区浴室	1000093	闵行东区浴室	
	水控系统	1000095	六期水控


9 other // not consider temperalily

codename	toaccount	accountname	address
	图书馆		1000098	借还书	
闵行校车队		1000101	闵行校车队	
卡中心综合业	1000127	本科生学务收费	闵行行政楼B楼一楼，   中行资产
图书馆			1000137	图书馆自助复印	


综合体育馆	1000190	综合体育馆	综合体育馆150房间
南区体育馆	1000191	南区体育馆	南区体育馆104房间
网球场	1000193	网球场	学生服务中心205房间
学生服务中心	1000194	学生服务中心	学生服务中心205房间
学生活动中心光彪楼	1000195	学生活动中心光彪楼	光彪楼前台
致远游泳健身馆1	1000236	致远游泳健身馆1	致远游泳健身馆
致远游泳健身馆2	1000240	致远游泳健身馆2	致远游泳健身馆
曦潮书店	1000237	曦潮书店	华联一层101室
'''
